.emacs.d/Emacs.org
* Setup package straight.el
  Next-generation, purely functional package manager for the Emacs hacker.

  #+BEGIN_SRC emacs-lisp
    (defvar bootstrap-version)
    (let ((bootstrap-file
	   (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	  (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
	(with-current-buffer
	    (url-retrieve-synchronously
	     "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	     'silent 'inhibit-cookies)
	  (goto-char (point-max))
	  (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))
  #+END_SRC
  
** Install use package
   #+BEGIN_SRC emacs-lisp
     (straight-use-package 'use-package)
   #+END_SRC

* General settings
** No splash screen please ... jeez
   #+BEGIN_SRC emacs-lisp
     (setq inhibit-startup-message t)
   #+END_SRC
** Disable stuff UI
   #+BEGIN_SRC emacs-lisp
     (menu-bar-mode -1)
     (tool-bar-mode -1)
     (scroll-bar-mode -1)
   #+END_SRC
** Show matching highlight
   #+BEGIN_SRC emacs-lisp
     (electric-pair-mode)
     (show-paren-mode)
   #+END_SRC
** Customize custom file
   #+BEGIN_SRC emacs-lisp
     (setq custom-file (concat user-emacs-directory "custom.el"))
     (load custom-file 'noerror)
   #+END_SRC
** Disable backup
   #+BEGIN_SRC emacs-lisp
     (setq make-backup-files nil)
     (setq auto-save-default nil)
     (setq create-lockfiles nil)
   #+END_SRC
** COMMENT Customize modeline
   #+BEGIN_SRC emacs-lisp
     (defvar cogent-line-selected-window (frame-selected-window))
     (defun cogent-line-set-selected-window (&rest _args)
       (when (not (minibuffer-window-active-p (frame-selected-window)))
	 (setq cogent-line-selected-window (frame-selected-window))
	 (force-mode-line-update)))
     (defun cogent-line-unset-selected-window ()
       (setq cogent-line-selected-window nil)
       (force-mode-line-update))
     (add-hook 'window-configuration-change-hook #'cogent-line-set-selected-window)
     (add-hook 'focus-in-hook #'cogent-line-set-selected-window)
     (add-hook 'focus-out-hook #'cogent-line-unset-selected-window)
     (advice-add 'handle-switch-frame :after #'cogent-line-set-selected-window)
     (advice-add 'select-window :after #'cogent-line-set-selected-window)
     (defun cogent-line-selected-window-active-p ()
       (eq cogent-line-selected-window (selected-window)))

     (setq-default mode-line-format
		   (list
		    " "
		    mode-line-misc-info ; for eyebrowse
		    '(:eval (list
			     ;; the buffer name; the file name as a tool tip
			     (propertize " %b" 'face 'font-lock-type-face
					 'help-echo (buffer-file-name))
			     (when (buffer-modified-p)
			       (propertize
				" "
				'face (if (cogent-line-selected-window-active-p)
					  'cogent-line-modified-face
					'cogent-line-modified-face-inactive)))
			     (when buffer-read-only
			       (propertize
				""
				'face (if (cogent-line-selected-window-active-p)
					  'cogent-line-read-only-face
					'cogent-line-read-only-face-inactive)))
			     " "))
		    '(:eval (when-let (vc vc-mode)
			      (list " "
				    (propertize (substring vc 5)
						'face 'font-lock-comment-face)
				    " ")))



		    ;; spaces to align right
		    '(:eval (propertize
			     " " 'display
			     `((space :align-to (- (+ right right-fringe right-margin)
						   ,(+ 3 (string-width mode-name)))))))

		    ;; the current major mode
		    (propertize " %m " 'face 'font-lock-string-face)))
   #+END_SRC
** Theme
I'll use modus themes because it's builtin to emacs and it's pretty good

#+BEGIN_SRC emacs-lisp
  (defun setup-themes (theme)
    (set-frame-font "Iosevka 20" nil t)
    (setq default-frame-alist '((font . "Iosevka 20")))
    (load-theme theme t))

  (setup-themes 'modus-operandi)
#+END_SRC

* Third party packages
** Helm completion
   Helm is an Emacs framework for incremental completions and narrowing selections.
   It helps to rapidly complete file names, buffer names, or any other Emacs
   interactions requiring selecting an item from a list of possible choices.
   Helm is a fork of anything.el, which was originally written by Tamas Patrovic and
   can be considered to be its successor. Helm cleans the legacy code that is leaner,
   modular, and unchained from constraints of backward compatibility.
   #+BEGIN_SRC emacs-lisp
     (defun cherry/smart-kill-buffer ()
       (interactive)
       (if (one-window-p)
	   (kill-current-buffer)
	 (progn
	   (kill-current-buffer)
	   (delete-window))))

     (use-package helm
       :straight t
       :bind (("C-x C-f" . helm-find-files)
	      ("M-x" . helm-M-x)
	      ("C-x k" . cherry/smart-kill-buffer))
       :init (helm-mode 1))
   #+END_SRC
** Typescript/Web mode/tide/eslint/prettier setup
   This is my whole setup for typescript and *.tsx with tide.
   #+BEGIN_SRC emacs-lisp
     (use-package typescript-mode :straight t)

     (use-package web-mode
       :straight t	  
       :config
       (define-derived-mode web-tsx-mode typescript-mode "TSX")
       (setq typescript-indent-level 2)
       (add-to-list 'auto-mode-alist '("\\.tsx?\\'" . web-tsx-mode)))

     (use-package prettier-js
       :after (web-mode typescript-mode)
       :straight t
       :hook ((web-tsx-mode . prettier-js-mode)
	      (typescript-mode . prettier-js-mode)))

     (use-package tide
       :straight t
       :config
       (defun setup-tide-mode ()
	 (interactive)
	 (tide-setup)
	 (eldoc-mode +1)
	 (tide-hl-identifier-mode +1))
       (add-hook 'typescript-mode-hook #'setup-tide-mode)
       (add-hook 'web-tsx-mode #'setup-tide-mode))

     (use-package flymake-eslint
       :after bind-key
       :straight t
       :config
       (bind-keys
	("C-c ! l" . flymake-show-diagnostics-buffer)
	("C-x n" . flymake-goto-next-error)
	("C-x p" . flymake-goto-prev-error))
       (add-hook 'web-tsx-mode-hook (lambda () (flymake-eslint-enable)))
       (add-hook 'typescript-mode-hook (lambda () (flymake-eslint-enable))))
   #+END_SRC
** Tree sitter
   tree-sitter is an Emacs binding for Tree-sitter, an incremental parsing system.

   It aims to be the foundation for a new breed of Emacs packages that understand
   code structurally. For example:

   - Faster, fine-grained code highlighting.
   - More flexible code folding.
   - Structural editing (like Paredit, or even better) for non-Lisp code.
   - More informative indexing for imenu.
     
   #+BEGIN_SRC emacs-lisp
     (use-package tree-sitter :straight t)
     (use-package tree-sitter-langs
       :straight t	     
       :after tree-sitter
       :config
       (tree-sitter-require 'tsx)
       (add-to-list 'tree-sitter-major-mode-language-alist '(web-tsx-mode . tsx))
       (add-hook 'web-tsx-mode-hook 'tree-sitter-hl-mode)
       (add-hook 'typescript-mode 'tree-sitter-hl-mode))
   #+END_SRC
** Modeline
The idea here is install mood-line with minions together.
*** Minions
This package implements a menu that lists enabled minor-modes, as well
as commonly but not currently enabled minor-modes. It can be used to
toggle local and global minor-modes, to access mode-specific menus,
and to get help about modes.

This menu is intended as a replacement for the incomplete yet wide
list of enabled minor-modes that is displayed in the mode line by
default. To use the menu like this, enable Minions mode.
#+BEGIN_SRC emacs-lisp
  (use-package minions
    :straight t
    :config (minions-mode 1))
#+END_SRC
*** Mood line
=mood-line= is a minimal mode-line configuration that aims to
replicate some of the features of the doom-modeline package.
#+BEGIN_SRC emacs-lisp
  (use-package mood-line
    :straight t
    :init (mood-line-mode))
#+END_SRC

** Company inline completion
   Company is a text completion framework for Emacs. The name stands for
   "complete anything". It uses pluggable back-ends and front-ends to retrieve and
   display completion candidates.
   #+BEGIN_SRC emacs-lisp
     (use-package company-mode
       :straight t    
       :hook (after-init . global-company-mode))

     (use-package company-box
       :straight t
       :hook (company-mode . company-box-mode))
   #+END_SRC
** Structural editing for lisp
   ParEdit (paredit.el) is a minor mode for performing structured editing of
   S-expression data. The typical example of this would be Lisp or Scheme source code.

   ParEdit helps **keep parentheses balanced** and adds many keys for moving
   S-expressions and moving around in S-expressions. Its behavior can be jarring for
   those who may want transient periods of unbalanced parentheses, such as when
   typing parentheses directly or commenting out code line by line.

   #+BEGIN_SRC emacs-lisp
     (use-package paredit
       :straight t
       :config
       (add-hook 'emacs-lisp-mode-hook 'paredit-mode))
   #+END_SRC
** Bind general keys
   A simple way to manage personal keybindings with =bind-key= and helper
   functions from =crux=

   #+BEGIN_SRC emacs-lisp
     (defun cherry/delete-word-or-region ()
       (interactive)
       (if (region-active-p)
	   (call-interactively #'kill-region) ;; then
	 (backward-kill-word 1)))

     (use-package bind-key
       :straight t
       :config
       (bind-keys
	("M-SPC" . hippie-expand)
	("M-n" . forward-paragraph)
	("M-p" . backward-paragraph)
	("C-w" . cherry/delete-word-or-region)
	("s-c" . delete-frame)
	("C-h" . delete-backward-char)))

     (use-package crux
       :after bind-key
       :straight t
       :config
       (bind-keys
	("C-u" . crux-kill-whole-line)
	("C-c k" . crux-kill-other-buffers)
	("C-c d" . crux-duplicate-current-line-or-region)
	("C-c I" . crux-find-user-init-file)
	("ESC c" . (lambda () (interactive) (find-file "~/.emacs.d/Emacs.org")))
	("C-o" . crux-smart-open-line)
	("C-c t" . nil)
	("C-c tn" . crux-visit-term-buffer)
	("s-j" . crux-top-join-line)))
   #+END_SRC
** Multiple cursors
   Multiple cursors for Emacs. This is some pretty crazy functionality, so yes,
   there are kinks. Don't be afraid though, I've been using it since 2011 with
   great success and much merriment.

   #+BEGIN_SRC emacs-lisp
     (use-package multiple-cursors
       :straight t
       :config
       (global-set-key (kbd "C->") 'mc/mark-next-like-this)
       (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
       (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))
   #+END_SRC
** Expand region
   Expand region increases the selected region by semantic units. Just keep pressing
   the key until it selects what you want.

   #+BEGIN_SRC emacs-lisp
     (use-package expand-region
       :straight t
       :config
       (global-set-key (kbd "C-=") 'er/expand-region))
   #+END_SRC
