.emacs.d/Emacs.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(setq inhibit-startup-message t)

(menu-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(scroll-bar-mode -1)

(electric-pair-mode)
(show-paren-mode)

(setq custom-file (concat user-emacs-directory "custom.el"))
(load custom-file 'noerror)

(setq make-backup-files nil)
(setq auto-save-default nil)
(setq create-lockfiles nil)

(defun cherry/smart-kill-buffer ()
  (interactive)
  (if (one-window-p)
      (kill-current-buffer)
    (progn
      (kill-current-buffer)
      (delete-window))))

(use-package helm
  :straight t
  :bind (("C-x C-f" . helm-find-files)
	 ("M-x" . helm-M-x)
	 ("C-x k" . cherry/smart-kill-buffer))
  :init (helm-mode 1))

(use-package typescript-mode :straight t)

(use-package web-mode
  :straight t	  
  :config
  (define-derived-mode web-tsx-mode typescript-mode "TSX")
  (setq typescript-indent-level 2)
  (add-to-list 'auto-mode-alist '("\\.tsx?\\'" . web-tsx-mode)))

(use-package prettier-js
  :after (web-mode typescript-mode)
  :straight t
  :hook ((web-tsx-mode . prettier-js-mode)
	 (typescript-mode . prettier-js-mode)))

(use-package tide
  :straight t
  :config
  (defun setup-tide-mode ()
    (interactive)
    (tide-setup)
    (eldoc-mode +1)
    (tide-hl-identifier-mode +1))
  (add-hook 'typescript-mode-hook #'setup-tide-mode)
  (add-hook 'web-tsx-mode #'setup-tide-mode))

(use-package flymake-eslint
  :after bind-key
  :straight t
  :config
  (bind-keys
   ("C-c ! l" . flymake-show-diagnostics-buffer)
   ("C-x n" . flymake-goto-next-error)
   ("C-x p" . flymake-goto-prev-error))
  (add-hook 'web-tsx-mode-hook (lambda () (flymake-eslint-enable)))
  (add-hook 'typescript-mode-hook (lambda () (flymake-eslint-enable))))

(use-package tree-sitter :straight t)
(use-package tree-sitter-langs
  :straight t	     
  :after tree-sitter
  :config
  (tree-sitter-require 'tsx)
  (add-to-list 'tree-sitter-major-mode-language-alist '(web-tsx-mode . tsx))
  (add-hook 'web-tsx-mode-hook 'tree-sitter-hl-mode)
  (add-hook 'typescript-mode 'tree-sitter-hl-mode))

(use-package doom-themes
  :straight t
  :config
  (defun setup-themes (theme)
    (set-frame-font "Iosevka 20" nil t)
    (setq default-frame-alist '((font . "Iosevka 20")))
    (load-theme theme t))

  (setq doom-themes-enable-bold t
	doom-themes-enable-italic t)

  (setup-themes 'doom-one))

(use-package company-mode
  :straight t    
  :hook (after-init . global-company-mode))

(use-package company-box
  :straight t
  :hook (company-mode . company-box-mode))

(use-package paredit
  :straight t
  :config
  (add-hook 'emacs-lisp-mode-hook 'paredit-mode))

(defun cherry/delete-word-or-region ()
  (interactive)
  (if (region-active-p)
      (call-interactively #'kill-region) ;; then
    (backward-kill-word 1)))

(use-package bind-key
  :straight t
  :config
  (bind-keys
   ("M-SPC" . hippie-expand)
   ("M-n" . forward-paragraph)
   ("M-p" . backward-paragraph)
   ("C-w" . cherry/delete-word-or-region)
   ("s-c" . delete-frame)
   ("C-h" . delete-backward-char)))

(use-package crux
  :after bind-key
  :straight t
  :config
  (bind-keys
   ("C-u" . crux-kill-whole-line)
   ("C-c k" . crux-kill-other-buffers)
   ("C-c d" . crux-duplicate-current-line-or-region)
   ("C-c I" . crux-find-user-init-file)
   ("ESC c" . (lambda () (interactive) (find-file "~/.emacs.d/Emacs.org")))
   ("C-o" . crux-smart-open-line)
   ("C-c t" . nil)
   ("C-c tn" . crux-visit-term-buffer)
   ("s-j" . crux-top-join-line)))

(use-package multiple-cursors
  :straight t
  :config
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this))

(use-package expand-region
  :straight t
  :config
  (global-set-key (kbd "C-=") 'er/expand-region))
