.emacs.d/Emacs.org
** Projectile
   Projectile is a project interaction library for Emacs. Its goal is to provide a
   nice set of features operating on a project level without introducing external
   dependencies (when feasible). For instance - finding project files has a portable
   implementation written in pure Emacs Lisp without the use of
   GNU find (but for performance sake an indexing mechanism backed by external commands
   exists as well).
   Projectile tries to be practical - portability is great, but if some external
   tools could speed up some task substantially and the tools are available, Projectile
   will leverage them.
   This library provides easy project management and navigation. The concept of a
   project is pretty basic - just a folder containing some special
   file (e.g. a VCS marker or a project descriptor file like pom.xml or Gemfile).
   Projectile will auto-detect pretty much every popular project type out of the
   box and you can easily extend it with additional project types.

   #+BEGIN_SRC emacs-lisp
     (use-package projectile
       :straight t
       :config
       (projectile-mode +1)
       (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map))
   #+END_SRC
** Which key
   Emacs package that displays available keybindings in popup

   #+BEGIN_SRC emacs-lisp
     (use-package which-key
       :straight t
       :init (which-key-mode))
   #+END_SRC
** Magit
   Magit is a complete text-based user interface to Git. It fills the glaring gap
   between the Git command-line interface and various GUIs, letting you perform
   trivial as well as elaborate version control tasks with just a couple of mnemonic
   key presses. Magit looks like a prettified version of what you get after running a
   few Git commands but in Magit every bit of visible information is also actionable
   to an extent that goes far beyond what any Git GUI provides and it takes care
   of automatically refreshing this output when it becomes outdated. In the
   background Magit just runs Git commands and if you wish you can see what exactly
   is being run, making it possible for you to learn the git command-line by using Magit.

   Using Magit for a while will make you a more effective version control user.
   Magit supports and streamlines the use of Git features that most users and
   developers of other Git clients apparently thought could not be reasonably
   mapped to a non-command-line interface. Magit is both faster and more intuitive
   than either the command line or any GUI and these holds for both
   Git beginners and experts alike.

   #+BEGIN_SRC emacs-lisp
     (use-package magit
       :after bind-key
       :straight t
       :config
       (defun magit-fullscreen ()
	 (interactive)
	 (magit-status)
	 (delete-other-windows))
       (bind-key "C-x g" 'magit-fullscreen))
   #+END_SRC
** Bufler
   Bufler is like a butler for your buffers, presenting them to you in an
   organized way based on your instructions. The instructions are written as grouping
   rules in a simple language, allowing you to customize the way buffers are
   grouped. The default rules are designed to be generally useful, so you don’t have
   to write your own.

   It also provides a workspace mode which allows frames to focus on buffers in
   certain groups. Since the groups are created automatically, the workspaces are
   created dynamically, rather than requiring you to put buffers in workspaces manually.

   #+BEGIN_SRC emacs-lisp
     (use-package bufler
       :after bind-key
       :straight t
       :config (bind-key "C-x C-b" 'bufler))
   #+END_SRC
** Org roam
   Org-roam is a plain-text knowledge management system. It brings some of
   Roam's more powerful features into the Org-mode ecosystem.

   Org-roam borrows principles from the Zettelkasten method, providing a solution for
   non-hierarchical note-taking. It should also work as a plug-and-play
   solution for anyone already using Org-mode for their personal wiki.

   #+BEGIN_SRC emacs-lisp
     (use-package org-roam
       :straight t
       :after org
       :init (setq org-roam-v2-ack t) ;; Acknowledge V2 upgrade
       :custom
       (org-roam-directory (file-truename org-directory))
       :config
       (org-roam-setup)
       :bind (("C-c n f" . org-roam-node-find)
	      ("C-c n g" . org-roam-graph)
	      ("C-c n r" . org-roam-node-random)    
	      ("C-c n c" . org-roam-capture)
	      (:map org-mode-map
		    (("C-c n i" . org-roam-node-insert)
		     ("C-c n o" . org-id-get-create)
		     ("C-c n t" . org-roam-tag-add)
		     ("C-c n a" . org-roam-alias-add)
		     ("C-c n l" . org-roam-buffer-toggle)))))
   #+END_SRC
** Org download
   This extension facilitates moving images from point A to point B.

   Point A (the source) can be:
   
   An image inside your browser that you can drag to Emacs.
   An image on your file system that you can drag to Emacs.
   A local or remote image address in kill-ring. Use the org-download-yank command for
   this. Remember that you can use "0 w" in dired to get an address.
   A screenshot taken using gnome-screenshot, scrot, gm, xclip (on Linux),
   screencapture (on OS X) or , imagemagick/convert (on Windows).
   Use the org-download-screenshot command for this. Customize the backend with
   org-download-screenshot-method.
   
   Point B (the target) is an Emacs org-mode buffer where the inline link
   will be inserted. Several customization options will determine where
   exactly on the file system the file will be stored.

   #+BEGIN_SRC emacs-lisp
     (use-package org-download :straight t)
   #+END_SRC
** Lua mode
   #+BEGIN_SRC emacs-lisp
     (use-package lua-mode :straight t)
   #+END_SRC
** Mu4e mailing
   mu4e is an email client for Emacs. It’s based on the mu email indexer/searcher.

   It's not information overload. It's filter failure. mu4e's mission is to
   be a better filter. --Prof. Shirky

   #+BEGIN_SRC emacs-lisp
     (use-package mu4e
       :after bind-key
       :ensure nil
       :load-path "/usr/share/emacs/site-lisp/mu4e/"
       :config
       ;; this is set to 't' to avoid mail syncing issues when using mbsync
       (setq mu4e-change-filenames-when-moving t)

       ;; Refresh mail using isync every 10 minutes
       (setq mu4e-update-interval (* 10 60))
       (setq mu4e-get-mail-command "mbsync -a")
       (setq mu4e-maildir "~/Mail")

       (setq mu4e-drafts-folder "/[Gmail].Drafts")
       (setq mu4e-sent-folder "/[Gmail].Sent Mail")
       (setq mu4e-refile-folder "/[Gmail].All Mail")
       (setq mu4e-trash-folder "/[Gmail].Trash")

       (setq mu4e-maildir-shortcuts
	     '(("/Inbox" . ?i)
	       ("/[Gmail].Sent Mail" . ?s)
	       ("/[Gmail].Trash" . ?t)
	       ("/[Gmail].Drafts" . ?d)
	       ("/[Gmail] All Mail" . ?a)))

       (setq smtpmail-smtp-server "smtp.gmail.com"
	     smtpmail-smtp-service 465
	     smtpmail-stream-type 'ssl)

       (setq message-send-mail-function 'smtpmail-send-it)

       (bind-key "C-c m" 'mu4e))
   #+END_SRC
