.emacs.d/Emacs.el

(use-package which-key
  :straight t
  :init (which-key-mode))

(use-package magit
  :after bind-key
  :straight t
  :config
  (defun magit-fullscreen ()
    (interactive)
    (magit-status)
    (delete-other-windows))
  (bind-key "C-x g" 'magit-fullscreen))

(use-package bufler
  :after bind-key
  :straight t
  :config (bind-key "C-x C-b" 'bufler))

(use-package org-roam
  :straight t
  :after org
  :init (setq org-roam-v2-ack t) ;; Acknowledge V2 upgrade
  :custom
  (org-roam-directory (file-truename org-directory))
  :config
  (org-roam-setup)
  :bind (("C-c n f" . org-roam-node-find)
	 ("C-c n g" . org-roam-graph)
	 ("C-c n r" . org-roam-node-random)    
	 ("C-c n c" . org-roam-capture)
	 (:map org-mode-map
	       (("C-c n i" . org-roam-node-insert)
		("C-c n o" . org-id-get-create)
		("C-c n t" . org-roam-tag-add)
		("C-c n a" . org-roam-alias-add)
		("C-c n l" . org-roam-buffer-toggle)))))

(use-package org-download :straight t)

(use-package lua-mode :straight t)

(use-package mu4e
  :after bind-key
  :ensure nil
  :load-path "/usr/share/emacs/site-lisp/mu4e/"
  :config
  ;; this is set to 't' to avoid mail syncing issues when using mbsync
  (setq mu4e-change-filenames-when-moving t)

  ;; Refresh mail using isync every 10 minutes
  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Mail")

  (setq mu4e-drafts-folder "/[Gmail].Drafts")
  (setq mu4e-sent-folder "/[Gmail].Sent Mail")
  (setq mu4e-refile-folder "/[Gmail].All Mail")
  (setq mu4e-trash-folder "/[Gmail].Trash")

  (setq mu4e-maildir-shortcuts
	'(("/Inbox" . ?i)
	  ("/[Gmail].Sent Mail" . ?s)
	  ("/[Gmail].Trash" . ?t)
	  ("/[Gmail].Drafts" . ?d)
	  ("/[Gmail] All Mail" . ?a)))

  (setq smtpmail-smtp-server "smtp.gmail.com"
	smtpmail-smtp-service 465
	smtpmail-stream-type 'ssl)

  (setq message-send-mail-function 'smtpmail-send-it)

  (bind-key "C-c m" 'mu4e))
