.emacs.d/Emacs.org
** Emmet
   #+BEGIN_SRC emacs-lisp
     (use-package emmet-mode
       :straight t
       :hook ((web-tsx-mode . emmet-mode))
       :config
       (add-to-list 'emmet-jsx-major-modes 'web-tsx-mode))
   #+END_SRC
** Dired single buffer
   #+BEGIN_SRC emacs-lisp
     (use-package dired-single
       :straight t
       :bind (("C-x C-j" . dired-jump)
	      :map dired-mode-map
	      ("RET" . dired-find-file)
	      ([backspace] . dired-single-up-directory)))
   #+END_SRC
* Built-in packages
** Org mode
   A GNU Emacs major mode for keeping notes, authoring documents,
   computational notebooks, literate programming, maintaining to-do lists,
   planning projects, and more — in a fast and effective plain text system.

   #+BEGIN_SRC emacs-lisp
     (use-package org
       :after bind-key
       :config
       (setq org-ellipsis " ▾")

       (setq org-agenda-start-with-log-mode t)
       (setq org-log-done 'time)
       (setq org-log-into-drawer t)

       (setq org-directory (concat (getenv "HOME") "/projects/dotfiles/wiki"))
       (setq org-agenda-files '("~/projects/dotfiles/tasks/todo.org"))
       (setq org-agenda-skip-function-global '(org-agenda-skip-entry-if 'todo 'done))

	(setq org-capture-templates
	      `(("t" "Task")
		("tp" "Task Personal" entry (file+olp "~/projects/dotfiles/tasks/todo.org" "Inbox - Personal")
		 "* TODO %?\n SCHEDULED: %^t\n %a\n  %i" :empty-lines 0)
		("tw" "Task Work" entry (file+olp "~/projects/dotfiles/tasks/todo.org" "Inbox - Work")
		 "* TODO %?\n SCHEDULED: %^t\n %a\n  %i" :empty-lines 0)))

	;; Format better paragraphs
	(add-hook 'org-mode-hook 'turn-on-auto-fill)
   
	(bind-key "C-c c" 'org-capture)
	(bind-key "C-c a " 'org-agenda))
   #+END_SRC
** Ansi terminal
   This is a terminal emulator written in EmacsLisp. Now you can run vi (or mutt! (see MuttInEmacs) (or Emacs!)) in an Emacs buffer!
   
   #+BEGIN_SRC emacs-lisp
     (setq explicit-shell-file-name "/usr/bin/fish")

     (defun cherry/term-exec-hook ()
       (let* ((buff (current-buffer))
	      (proc (get-buffer-process buff)))
	 (set-process-sentinel
	  proc
	  `(lambda (process event)
	     (if (string= event "finished\n")
		 (progn
		   (kill-buffer ,buff)
		   (delete-window)))))))

     (add-hook 'term-exec-hook 'cherry/term-exec-hook)

     (eval-after-load "term"
       '(define-key term-raw-map (kbd "C-y") 'term-paste))
   #+END_SRC
* Customizing
** Offer to create parent directories if they do not exist
   http://iqbalansari.github.io/blog/2014/12/07/automatically-create-parent-directories-on-visiting-a-new-file-in-emacs/

   #+BEGIN_SRC emacs-lisp
     (defun my-create-non-existent-directory ()
       (let ((parent-directory (file-name-directory buffer-file-name)))
	 (when (and (not (file-exists-p parent-directory))
		    (y-or-n-p (format "Directory `%s' does not exist! Create it?" parent-directory)))
	   (make-directory parent-directory t))))

     (add-to-list 'find-file-not-found-functions 'my-create-non-existent-directory)
   #+END_SRC
** Open current branch on browser github Pull request url (magit)
   I use magit to work with git and emacs. Magit makes it easy to create branches and push them to github. After creating a branch, the natural thing is to create a pull request.
   But one has to visit github and click on "New pull request" to create the pull request.

   I want to create the pull request automatically from emacs and magit. After googling for this issue, I came across this [[https://endlessparentheses.com/create-github-prs-from-emacs-with-magit.html][solution]].
   #+BEGIN_SRC emacs-lisp
     (defun cherry/visit-pull-request-url ()
       "Visit the current branch's PR on Github."
       (interactive)
       (browse-url
	(format "https://github.com/%s/pull/new/%s"
		(replace-regexp-in-string
		 "\\`.+github\\.com:\\(.+\\)\\.git\\'" "\\1"
		 (magit-get "remote"
			    (magit-get-push-remote)
			    "url"))
		(magit-get-current-branch))))

     (eval-after-load 'magit
       '(define-key magit-mode-map "v" #'cherry/visit-pull-request-url))
   #+END_SRC

