.emacs.d/Emacs.el

(use-package emmet-mode
  :straight t
  :hook ((web-tsx-mode . emmet-mode))
  :config
  (add-to-list 'emmet-jsx-major-modes 'web-tsx-mode))

(use-package dired-single
  :straight t
  :bind (("C-x C-j" . dired-jump)
	 :map dired-mode-map
	 ("RET" . dired-find-file)
	 ([backspace] . dired-single-up-directory)))

(use-package org
  :after bind-key
  :config
  (setq org-ellipsis " ▾")

  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  (setq org-directory (concat (getenv "HOME") "/projects/dotfiles/wiki"))
  (setq org-agenda-files '("~/projects/dotfiles/tasks/todo.org"))
  (setq org-agenda-skip-function-global '(org-agenda-skip-entry-if 'todo 'done))

   (setq org-capture-templates
	 `(("t" "Task")
	   ("tp" "Task Personal" entry (file+olp "~/projects/dotfiles/tasks/todo.org" "Inbox - Personal")
	    "* TODO %?\n SCHEDULED: %^t\n %a\n  %i" :empty-lines 0)
	   ("tw" "Task Work" entry (file+olp "~/projects/dotfiles/tasks/todo.org" "Inbox - Work")
	    "* TODO %?\n SCHEDULED: %^t\n %a\n  %i" :empty-lines 0)))
   (bind-key "C-c c" 'org-capture)
   (bind-key "C-c a " 'org-agenda))

(setq explicit-shell-file-name "/usr/bin/fish")

(defun cherry/term-exec-hook ()
  (let* ((buff (current-buffer))
	 (proc (get-buffer-process buff)))
    (set-process-sentinel
     proc
     `(lambda (process event)
	(if (string= event "finished\n")
	    (progn
	      (kill-buffer ,buff)
	      (delete-window)))))))

(add-hook 'term-exec-hook 'cherry/term-exec-hook)

(eval-after-load "term"
  '(define-key term-raw-map (kbd "C-y") 'term-paste))

(defun my-create-non-existent-directory ()
  (let ((parent-directory (file-name-directory buffer-file-name)))
    (when (and (not (file-exists-p parent-directory))
	       (y-or-n-p (format "Directory `%s' does not exist! Create it?" parent-directory)))
      (make-directory parent-directory t))))

(add-to-list 'find-file-not-found-functions 'my-create-non-existent-directory)

(defun cherry/visit-pull-request-url ()
  "Visit the current branch's PR on Github."
  (interactive)
  (browse-url
   (format "https://github.com/%s/pull/new/%s"
	   (replace-regexp-in-string
	    "\\`.+github\\.com:\\(.+\\)\\.git\\'" "\\1"
	    (magit-get "remote"
		       (magit-get-push-remote)
		       "url"))
	   (magit-get-current-branch))))

(eval-after-load 'magit
  '(define-key magit-mode-map "v" #'cherry/visit-pull-request-url))
